# FileName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFileWriteOptions..::..FileName Property
IFCFileWriteOptions Class See Also
---
The full file name of the IFC file to be written.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string FileName { get; set; }
```

Visual Basic
---
```text
Public Property FileName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ FileName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace